/*
 *  $Id: py_table.c,v 1.4 2005/04/10 15:26:37 aonoto Exp $
 */

/*
 * FreeWnn is a network-extensible Kana-to-Kanji conversion system.
 * This file is part of FreeWnn.
 * 
 * Copyright Kyoto University Research Institute for Mathematical Sciences
 *                 1987, 1988, 1989, 1990, 1991, 1992
 * Copyright OMRON Corporation. 1987, 1988, 1989, 1990, 1991, 1992, 1999
 * Copyright ASTEC, Inc. 1987, 1988, 1989, 1990, 1991, 1992
 * Copyright FreeWnn Project 1999, 2000
 *
 * Maintainer:  FreeWnn Project   <freewnn@tomo.gr.jp>
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 2 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, write to the
 * Free Software Foundation, Inc., 59 Temple Place - Suite 330,
 * Boston, MA 02111-1307, USA.
 */

/**  cWnn  Version 1.1   **/

#include  <ctype.h>
#include "commonhd.h"
#ifdef CHINESE
#include "cplib.h"

/* pyshengmu_tbl[]: ShengMu table of Chinese PinYin */
char *py_shengmu_tbl[PY_NUM_SHENGMU] = {

  "", "B", "C", "Ch", "D",
  "F", "G", "H", "J", "K",
  "L", "M", "N", "P", "Q",
  "R", "S", "Sh", "T", "W",
  "X", "Y", "Z", "Zh"
};

/* py_yunmu_tbl[]: YunMu table of Chinese ZhuYin */
char *py_yunmu_tbl[PY_NUM_YUNMU * 5] = {

  "é¿", "é¿", "é¿", "é¿", "é¿",
  "aé¿", "é°é¿", "é¢é¿", "é£é¿", "é§é¿",
  "aié¿", "é°ié¿", "é¢ié¿", "é£ié¿", "é§ié¿",
  "ané¿", "é°né¿", "é¢né¿", "é£né¿", "é§né¿",
  "angé¿", "é°ngé¿", "é¢ngé¿", "é£ngé¿", "é§ngé¿",
  "aoé¿", "é°oé¿", "é¢oé¿", "é£oé¿", "é§oé¿",
  "eé¿", "é•é¿", "é¶é¿", "éßé¿", "é®é¿",
  "eié¿", "é•ié¿", "é¶ié¿", "éßié¿", "é®ié¿",
  "ené¿", "é•né¿", "é¶né¿", "éßné¿", "é®né¿",
  "engé¿", "é•ngé¿", "é¶ngé¿", "éßngé¿", "é®ngé¿",
  "eré¿", "é•ré¿", "é¶ré¿", "éßré¿", "é®ré¿",
  "ié¿", "é©é¿", "é™é¿", "é´é¿", "é¨é¿",
  "iaé¿", "ié°é¿", "ié¢é¿", "ié£é¿", "ié§é¿",
  "iané¿", "ié°né¿", "ié¢né¿", "ié£né¿", "ié§né¿",
  "iangé¿", "ié°ngé¿", "ié¢ngé¿", "ié£ngé¿", "ié§ngé¿",
  "iaoé¿", "ié°oé¿", "ié¢oé¿", "ié£oé¿", "ié§oé¿",
  "ieé¿", "ié•é¿", "ié¶é¿", "iéßé¿", "ié®é¿",
  "iné¿", "é©né¿", "é™né¿", "é´né¿", "é¨né¿",
  "ingé¿", "é©ngé¿", "é™ngé¿", "é´ngé¿", "é¨ngé¿",
  "iongé¿", "ié≠ngé¿", "iéÆngé¿", "iéØngé¿", "ié∞ngé¿",
  "iué¿", "ié±é¿", "ié≤é¿", "ié≥é¿", "ié¥é¿",
  "mé¿", "mé¿", "mé¿", "mé¿", "mé¿",
  "né¿", "né¿", "éΩé¿", "éæé¿", "éøé¿",
  "ngé¿", "ngé¿", "ngé¿", "ngé¿", "ngé¿",
  "oé¿", "é≠é¿", "éÆé¿", "éØé¿", "é∞é¿",
  "ongé¿", "é≠ngé¿", "éÆngé¿", "éØngé¿", "é∞ngé¿",
  "oué¿", "é≠ué¿", "éÆué¿", "éØué¿", "é∞ué¿",
  "ué¿", "é±é¿", "é≤é¿", "é≥é¿", "é¥é¿",
  "uaé¿", "ué°é¿", "ué¢é¿", "ué£é¿", "ué§é¿",
  "uaié¿", "ué°ié¿", "ué¢ié¿", "ué£ié¿", "ué§ié¿",
  "uané¿", "ué°né¿", "ué¢né¿", "ué£né¿", "ué§né¿",
  "uangé¿", "ué°ngé¿", "ué¢ngé¿", "ué£ngé¿", "ué§ngé¿",
  "ueé¿", "ué•é¿", "ué¶é¿", "uéßé¿", "ué®é¿",
  "uié¿", "ué©é¿", "ué™é¿", "ué´é¿", "ué¨é¿",
  "uné¿", "é±né¿", "é≤né¿", "é≥né¿", "é¥né¿",
  "uoé¿", "ué≠é¿", "uéÆé¿", "uéØé¿", "ué∞é¿",
  "éπé¿", "éµé¿", "é∂é¿", "é∑é¿", "é∏é¿",
  "éπeé¿", "éπé•é¿", "éπé¶é¿", "éπéßé¿", "éπé®é¿",
  "0é¿", "1é¿", "2é¿", "3é¿", "4é¿",    /* for undefinited YunMu  */
};


/* pinyin_tbl:  size is NUM_SHENGMU*NUM_YUNMU, including empty ShengMu */
/*     and empty YunMu , and undefinited YunMu'-' */

int pinyin_tbl[PY_NUM_SHENGMU * PY_NUM_YUNMU] = {

  0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
  0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
  0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1,
  0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1,
  0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1,
  0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
  0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1,
  0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1,
  0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1,
  0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1,
  0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
  0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1,
  0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1,
  0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1,
  0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1,
  0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1,
  0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1,
  0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
  0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1,
  0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1,
  0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1,
  0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1
};
#endif /* CHINESE */
